-- MySQL dump 10.13  Distrib 5.7.20, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: weather_test
-- ------------------------------------------------------
-- Server version	5.7.20-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `weathers`
--

DROP TABLE IF EXISTS `weathers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `weathers` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `Date` datetime NOT NULL,
  `Wether_Type` longtext NOT NULL,
  `Id_City` int(11) NOT NULL,
  `Temperature_Day` decimal(18,2) NOT NULL,
  `Temperature_Night` decimal(18,2) NOT NULL,
  PRIMARY KEY (`Id`),
  KEY `IX_Id_City` (`Id_City`) USING HASH,
  CONSTRAINT `FK_Weathers_Cities_Id_City` FOREIGN KEY (`Id_City`) REFERENCES `cities` (`Id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=61 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `weathers`
--

LOCK TABLES `weathers` WRITE;
/*!40000 ALTER TABLE `weathers` DISABLE KEYS */;
INSERT INTO `weathers` VALUES (1,'2017-11-21 00:00:00','Пасмурно',1,1.00,-2.00),(2,'2017-11-21 00:00:00','Ясно',2,2.00,-2.00),(3,'2017-11-21 00:00:00','Пасмурно',3,1.00,-2.00),(4,'2017-11-21 00:00:00','Пасмурно',4,1.00,-2.00),(5,'2017-11-21 00:00:00','Пасмурно',5,1.00,-2.00),(6,'2017-11-21 00:00:00','Малооблачно',6,2.00,-2.00),(7,'2017-11-21 00:00:00','Малооблачно',7,2.00,-2.00),(8,'2017-11-21 00:00:00','Ясно',8,3.00,-1.00),(9,'2017-11-21 00:00:00','Малооблачно',9,2.00,-3.00),(10,'2017-11-21 00:00:00','Пасмурно',10,1.00,-2.00),(11,'2017-11-21 00:00:00','Пасмурно',11,1.00,-2.00),(12,'2017-11-21 00:00:00','Пасмурно',12,1.00,-2.00),(13,'2017-11-21 00:00:00','Пасмурно',13,1.00,-2.00),(14,'2017-11-21 00:00:00','Малооблачно',14,2.00,-1.00),(15,'2017-11-21 00:00:00','Облачно с прояснениями',15,2.00,-3.00),(16,'2017-11-21 00:00:00','Ясно',16,2.00,-2.00),(17,'2017-11-21 00:00:00','Пасмурно',17,2.00,-2.00),(18,'2017-11-21 00:00:00','Пасмурно',18,1.00,-2.00),(19,'2017-11-21 00:00:00','Пасмурно',19,1.00,-2.00),(20,'2017-11-21 00:00:00','Пасмурно',20,1.00,-2.00),(21,'2017-11-21 00:00:00','Облачно с прояснениями',21,0.00,-2.00),(22,'2017-11-21 00:00:00','Пасмурно',22,1.00,0.00),(23,'2017-11-21 00:00:00','Небольшой снег',23,-2.00,-2.00),(24,'2017-11-21 00:00:00','Небольшой дождь',24,2.00,-1.00),(25,'2017-11-21 00:00:00','Небольшой снег',25,-3.00,-5.00),(26,'2017-11-21 00:00:00','Небольшой снег',26,1.00,-3.00),(27,'2017-11-21 00:00:00','Небольшой дождь',27,13.00,8.00),(28,'2017-11-21 00:00:00','Снег',28,0.00,-1.00),(29,'2017-11-21 00:00:00','Небольшой дождь',29,3.00,0.00),(30,'2017-11-21 00:00:00','Небольшой дождь',30,2.00,1.00),(31,'2017-11-21 00:00:00','Небольшой снег',31,-7.00,-8.00),(32,'2017-11-21 00:00:00','Облачно с прояснениями',32,17.00,9.00),(33,'2017-11-21 00:00:00','Малооблачно',33,-2.00,-4.00),(34,'2017-11-21 00:00:00','Небольшой дождь',34,2.00,1.00),(35,'2017-11-21 00:00:00','Небольшой дождь',35,7.00,1.00),(36,'2017-11-21 00:00:00','Небольшой дождь',36,4.00,0.00),(37,'2017-11-21 00:00:00','Небольшой снег',37,-2.00,-6.00),(38,'2017-11-21 00:00:00','Небольшой снег',38,-3.00,-4.00),(39,'2017-11-21 00:00:00','Пасмурно',39,0.00,-2.00),(40,'2017-11-21 00:00:00','Небольшой снег',40,0.00,-3.00),(41,'2017-11-21 00:00:00','Ясно',41,8.00,-6.00),(42,'2017-11-21 00:00:00','Дождь',42,28.00,23.00),(43,'2017-11-21 00:00:00','Облачно с прояснениями',43,17.00,9.00),(44,'2017-11-21 00:00:00','Небольшой дождь',44,11.00,4.00),(45,'2017-11-21 00:00:00','Облачно с прояснениями',45,0.00,-2.00),(46,'2017-11-21 00:00:00','Ясно',46,24.00,10.00),(47,'2017-11-21 00:00:00','Облачно с прояснениями',47,4.00,-5.00),(48,'2017-11-21 00:00:00','Облачно с прояснениями',48,30.00,22.00),(49,'2017-11-21 00:00:00','Малооблачно',49,29.00,19.00),(50,'2017-11-21 00:00:00','Облачно с прояснениями',50,31.00,22.00),(51,'2017-11-21 00:00:00','Облачно с прояснениями',51,26.00,12.00),(52,'2017-11-21 00:00:00','Небольшой дождь',52,12.00,10.00),(53,'2017-11-21 00:00:00','Малооблачно',53,25.00,11.00),(54,'2017-11-21 00:00:00','Облачно с прояснениями',54,23.00,16.00),(55,'2017-11-21 00:00:00','Небольшой дождь',55,20.00,13.00),(56,'2017-11-21 00:00:00','Небольшой дождь',56,21.00,16.00),(57,'2017-11-21 00:00:00','Облачно с прояснениями',57,28.00,20.00),(58,'2017-11-21 00:00:00','Небольшой дождь',58,23.00,15.00),(59,'2017-11-21 00:00:00','Облачно с прояснениями',59,24.00,12.00),(60,'2017-11-21 00:00:00','Небольшой дождь',60,28.00,25.00);
/*!40000 ALTER TABLE `weathers` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-11-20 16:59:21
